---
kind: method
id: M:Autodesk.Revit.DB.EvaluatedParameter.AsValueString(Autodesk.Revit.DB.Document)
source: html/3eafc905-4eea-b409-7790-7e8c1947757b.htm
---
# Autodesk.Revit.DB.EvaluatedParameter.AsValueString Method

Get the parameter value as a string with units.

## Syntax (C#)
```csharp
public string AsValueString(
	Document doc
)
```

## Parameters
- **doc** (`Autodesk.Revit.DB.Document`) - The document to be used to obtain information about the parameter.

## Returns
The string that represents the parameter value.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null